[
  {
    "id": "1",
    "name": "Meenakshi Amman Temple",
    "image": "https://maduraitourism.co.in/images/places-to-visit/headers/sri-meenakshi-amman-sundareswarar-temple-madurai-entry-fee-timings-holidays-reviews-header.jpg",
    "description": "Also known as Meenakshi Sundareswarar temple, this temple is one of the most prominent shrines in India. Being one of the oldest temples of India, it is not only religiously significant but also presents an excellent example of Dravidian architecture. It is devoted to Lord Sundareswarar and his divine consort Goddess Meenakshi. Built during the Pandyan reign, this temple has seen various contributions from rulers of other dynasties as well. Its intricate carvings and majestic structures mesmerises everyone while its spiritual aura and associated legends enthral every devotee who come here to offer prayers.",
    "rating": 4.9,
    "price": "Free",
    "duration": "2",
    "location": "Madurai, Tamil Nadu",
    "category": "Temples",
    "latitude": "9.861111",
    "longitude": "78.117778"
  },
  {
    "id": "2",
    "name": "Koodal Azhagar Temple",
    "image": "https://maduraitourism.co.in/images/places-to-visit/headers/koodal-azhagar-temple-madurai-entry-fee-timings-holidays-reviews-header.jpg",
    "description": "Located in the centre of Madurai city, this temple is another popular shrine here. It is said to be one of the 108 holy abodes of Lord Vishnu. The main deity of this temple is Lord Koodal Azhagar. There is also a shrine of lord’s consort Goddess Madhuravalli. Built during Pandyan reign, it was later on renovated during the Nayak reign and rule of Vijayanagar Dynasty. What makes this temple even more significant is the mention of Koodal Alagar in the Hindu ancient text Brahmanda Purana.",
    "rating": 4.5,
    "price": "Free",
    "duration": "1",
    "location": "Madurai, Tamil Nadu",
    "category": "Temples",
    "latitude": "9.860000",
    "longitude": "78.110000"
  },
  {
    "id": "3",
    "name": "Azhagar Kovil",
    "image": "https://maduraitourism.co.in/images/places-to-visit/headers/azhagar-kovil-alagar-koyil-temple-madurai-entry-fee-timings-holidays-reviews-header.jpg",
    "description": "Located 21 km from Madurai city at the foothills of Alagar Hills, Alagar Koyil Temple is another masterpiece to be visited on a tour to Madurai. Dedicated to Lord Vishnu, this captivating temple has historical as well as religious high significance. Dating back to Sangam Period, it is said to be often visited by Pandyan king Malayadwaja Pandyan. Some of the additions to this temple were done during reign of Nayak Kings.",
    "rating": 4.4,
    "duration": "1.5",
    "price": "Free",
    "location": "Alagarmalai (around 20 km from Madurai)",
    "category": "Temples",
    "latitude": "10.046028",
    "longitude": "78.091722"
  },
  {
    "id": "4",
    "name": "Thiruparankundram Murugan Temple",
    "image": "https://maduraitourism.co.in/images/places-to-visit/headers/thiruparankundram-murugan-temple-madurai-tourism-entry-fee-timings-holidays-reviews-header.jpg",
    "description": "This temple is an arupadaiveedu, which means one of the six important temple dedicated Lord Murugan. Carved out of a mountain this temple presents alluring beauty. It is said to be built during Pandyan reign in the 8th century. There are also separate shrines for Lord Shiva, Lord Vinayaka, Lord Vishnu, goddess Durga and many other deities. While visiting this temple, devotees can also visit theertham such as Sanyasi Kinaru, Kasi Sunai, Sathiya Koopam, Saravana Poigai and Lakshmi Theertham.",
    "rating": 4.3,
    "duration": "2",
    "price": "Free",
    "location": "Madurai (around 7 km from city center)",
    "category": "Temples",
    "latitude": "9.822222",
    "longitude": "78.088889"
  },
  {
    "id": "5",
    "name": "Pudhu Mandapam",
    "image": "https://maduraitourism.co.in/images/places-to-visit/headers/puthu-mandapam-pudhu-madurai-tourism-entry-fee-timings-holidays-reviews-header.jpg",
    "description": "Built by King Thirumalai Nayakkar in 1635 as a summer abode for Lord Sundareswarar and Goddess Meenakshi, Puthu Mandapam is located towards the eastern side of Meenakshi Temple. With a captivating architecture, this place was used as a venue for temple festivals such as Avani Moolam, float festival and many others. Now a lively complex with innumerable shops, it is also used for hosting important temple festivals. This place is a must visit.",
    "rating": 4.2,
    "price": "Free",
    "duration": "1",
    "location": "Madurai, Tamil Nadu",
    "category": "Temples",
    "latitude": "9.852222",
    "longitude": "78.133333"
  },
  {
    "id": "6",
    "name": "Vandiyur Mariamman Teppakulam",
    "image": "https://maduraitourism.co.in/images/places-to-visit/headers/vandiyur-mariamman-teppakulam-madurai-entry-fee-timings-holidays-reviews-header.jpg",
    "description": "At a distance of only 2 km from Meenakshi temple, it is a temple pond associated with Vandiyur Mariamman Temple. Built in 1645 during the rule of Thirumalai Nayak, it was built with a temple in the middle which is dedicated to Lord Ganesha. Granite steps surround this pond from all the four sides. This holy tank is considered to be one of the largest temple tanks in the country.",
    "rating": 4.1,
    "price": "Free",
    "duration": "1",
    "location": "Madurai, Tamil Nadu",
    "category": "Temples",
    "latitude": "9.9102",
    "longitude": "78.1482"
  },
  {
    "id": "7",
    "name": "Thirumohoor Kalamegperumal Temple",
    "image": "https://maduraitourism.co.in/images/places-to-visit/headers/thirumohoor-kalamegaperumal-temple-madurai-tourism-entry-fee-timings-holidays-reviews-header.jpg",
    "description": "At a distance of 12 km from Madurai, dedicated to Lord Vishnu, this temple is one of 108 divya desams. Here the lord is worshipped as Neelamega Perumal with his divine consort Thirukannapuram Nayagi (Goddess Lakshmi). This temple was built during Pandyan Dynasty under the rule of King Sadaiya Varman Sundara Pandyan. One can find mention of this temple in many ancient Hindu texts as well. It is shrine worth visiting.",
    "rating": 4,
    "price": "Free",
    "duration": "1",
    "location": "Madurai, Tamil Nadu",
    "category": "Temples",
    "latitude": "9.57369",
    "longitude": "78.122556"
  }
]